import re

# Функція видаляє всі символи, крім цифр та символу '+'.
# Якщо міжнародний код відсутній, функція додає код '+38'. 
# Це враховує випадки, коли номер починається з '380' (додається лише '+') 
# та коли номер починається без коду (додається '+38').

def normalize_phone(phone_number):
    pattern = r"[\(\)\.\-\s\\]+|[a-z]|[A-Z]"
    repl = ''
    formatted_phone_number = re.sub(pattern, repl, phone_number)
    return formatted_phone_number



raw_numbers = [
    "067\\t123 4567", # '067Xt123X4567'
    "(095) 234-5678\\n", # 'X095X234X5678Xn'
    "+380 44 123 4567yui", # '+380X44X123X4567'
    "380501234567",
    "    +38(050)123-32-34",
    "     0503451234",
    "(050)8889900",
    "38050-111-22-22",
    "38050 111 22 11   ",
    "    +38(050)123-32-34",
    "     0503451234",
    "(050)8889900",
    "38050-111-22-22",
    "38050 111 22 11   "
]

sanitized_numbers = [normalize_phone(num) for num in raw_numbers]
print("Нормалізовані номери телефонів для SMS-розсилки:", sanitized_numbers)

# Нормалізовані номери телефонів для SMS-розсилки: 
# ['+380671234567', '+380952345678', '+380441234567', '+380501234567', 
# '+380501233234', '+380503451234', '+380508889900', '+380501112222', '+380501112211']
